Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS00/edc/PIC32CM5164LS00048.PIC
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL24" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL25" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL26" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL27" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CEC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL28" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL29" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="PCHCTRL30" edc:nzwidth="0x20" edc:access="------------------------nn---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7" edc:_addr="0x40001CF8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x3" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
