Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS00/edc/PIC32CM5164LS00048.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40002824"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="DEBOUNCEN" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="DEBOUNCEN0" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT0"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN1" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN2" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT2"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN3" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT3"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN4" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT4"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN5" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT5"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN6" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT6"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN7" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT7"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN8" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT8"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN9" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT9"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN10" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT10"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN11" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT11"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN12" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT12"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN13" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT13"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN14" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT14"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN15" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="DPRESCALER" edc:nzwidth="0x20" edc:access="---------------n--------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x100FF" edc:_addr="0x40002834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PRESCALER0" edc:nzwidth="0x3" edc:desc="Debouncer Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES0" edc:nzwidth="0x1" edc:desc="Debouncer number of states">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER1" edc:nzwidth="0x3" edc:desc="Debouncer Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES1" edc:nzwidth="0x1" edc:desc="Debouncer number of states">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TICKON" edc:nzwidth="0x1" edc:desc="Pin Sampler frequency selection">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK_EIC" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_LFREQ" edc:desc="Clocked by Low Frequency Clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="PINSTATE" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002838">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PINSTATE0" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT0"/>
            <edc:SFRFieldDef edc:cname="PINSTATE1" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE2" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT2"/>
            <edc:SFRFieldDef edc:cname="PINSTATE3" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT3"/>
            <edc:SFRFieldDef edc:cname="PINSTATE4" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT4"/>
            <edc:SFRFieldDef edc:cname="PINSTATE5" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT5"/>
            <edc:SFRFieldDef edc:cname="PINSTATE6" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT6"/>
            <edc:SFRFieldDef edc:cname="PINSTATE7" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT7"/>
            <edc:SFRFieldDef edc:cname="PINSTATE8" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT8"/>
            <edc:SFRFieldDef edc:cname="PINSTATE9" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT9"/>
            <edc:SFRFieldDef edc:cname="PINSTATE10" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT10"/>
            <edc:SFRFieldDef edc:cname="PINSTATE11" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT11"/>
            <edc:SFRFieldDef edc:cname="PINSTATE12" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT12"/>
            <edc:SFRFieldDef edc:cname="PINSTATE13" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT13"/>
            <edc:SFRFieldDef edc:cname="PINSTATE14" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT14"/>
            <edc:SFRFieldDef edc:cname="PINSTATE15" edc:nzwidth="0x1" edc:desc="Pin State of EXTINT15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NSCHK" edc:nzwidth="0x20" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8000FFFF" edc:_addr="0x4000283C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Nonsecure Check Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Nonsecure Check Enable"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:nzwidth="0x1" edc:desc="Non-Maskable External Interrupt Nonsecure Check Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NONSEC" edc:nzwidth="0x20" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8000FFFF" edc:_addr="0x40002840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Nonsecure Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Nonsecure Enable"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:nzwidth="0x1" edc:desc="Non-Maskable Interrupt Nonsecure Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1BC" edc:_addr="0x40002844"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="---n--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x13" edc:_addr="0x40002A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CKSEL" edc:nzwidth="0x1" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_ULP32K" edc:desc="Clocked by ULP32K" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NMICTRL" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0x40002A01">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMISENSE" edc:nzwidth="0x3" edc:desc="Non-Maskable Interrupt Sense Configuration">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising-edge detection" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling-edge detection" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both-edges detection" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High-level detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low-level detection" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NMIFILTEN" edc:nzwidth="0x1" edc:desc="Non-Maskable Interrupt Filter Enable"/>
            <edc:SFRFieldDef edc:cname="NMIASYNCH" edc:nzwidth="0x1" edc:desc="Asynchronous Edge Detection Mode">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NMIFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002A02">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMI" edc:nzwidth="0x1" edc:desc="Non-Maskable Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40002A03"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40002A04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy Status"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Busy Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="EVCTRL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002A08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINTEO0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8000FFFF" edc:_addr="0x40002A0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Enable"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-secure Check Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
