Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS00/edc/PIC32CM5164LS00048.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42003804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:nzwidth="0x1" edc:desc="Result Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:nzwidth="0x1" edc:desc="Window Monitor Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42003805">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:nzwidth="0x1" edc:desc="Result Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:nzwidth="0x1" edc:desc="Window Monitor Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42003806">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:nzwidth="0x1" edc:desc="Result Ready Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:nzwidth="0x1" edc:desc="Window Monitor Interrupt Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="SEQSTATUS" edc:nzwidth="0x8" edc:access="r--rrrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x9F" edc:_addr="0x42003807">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SEQSTATE" edc:nzwidth="0x5" edc:desc="Sequence State"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SEQBUSY" edc:nzwidth="0x1" edc:desc="Sequence Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="INPUTCTRL" edc:nzwidth="0x10" edc:access="---nnnnn---nnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1F1F" edc:_addr="0x42003808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x5" edc:desc="Positive Mux Input Selection">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="AIN8" edc:desc="ADC AIN8 Pin" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="AIN9" edc:desc="ADC AIN9 Pin" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="AIN10" edc:desc="ADC AIN10 Pin" edc:when="(field &amp; 0x1F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="AIN11" edc:desc="ADC AIN11 Pin" edc:when="(field &amp; 0x1F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="AIN12" edc:desc="ADC AIN12 Pin" edc:when="(field &amp; 0x1F) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="AIN13" edc:desc="ADC AIN13 Pin" edc:when="(field &amp; 0x1F) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="AIN14" edc:desc="ADC AIN14 Pin" edc:when="(field &amp; 0x1F) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="AIN15" edc:desc="ADC AIN15 Pin" edc:when="(field &amp; 0x1F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="AIN16" edc:desc="ADC AIN16 Pin" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="AIN17" edc:desc="ADC AIN17 Pin" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="AIN18" edc:desc="ADC AIN18 Pin" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="AIN19" edc:desc="ADC AIN19 Pin" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="AIN20" edc:desc="ADC AIN20 Pin" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="AIN21" edc:desc="ADC AIN21 Pin" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="AIN22" edc:desc="ADC AIN22 Pin" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="AIN23" edc:desc="ADC AIN23 Pin" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Internal Bandgap Voltage" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDVDDCORE" edc:desc="1/4 Scaled VDDCORE Supply" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDAVDD" edc:desc="1/4 Scaled AVDD Supply" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="DAC0 Output" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDVDD" edc:desc="1/4 Scaled VDD Supply" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="OPAMP01" edc:desc="OPAMP0 or OPAMP1 output" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="OPAMP2" edc:desc="OPAMP2 output" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x5" edc:desc="Negative Mux Input Selection">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Internal Ground" edc:when="(field &amp; 0x1F) == 0x18"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="CTRLC" edc:nzwidth="0x10" edc:access="-----nnn--nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x73F" edc:_addr="0x4200380A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DIFFMODE" edc:nzwidth="0x1" edc:desc="Differential Mode"/>
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left-Adjusted Result"/>
            <edc:SFRFieldDef edc:cname="FREERUN" edc:nzwidth="0x1" edc:desc="Free Running Mode"/>
            <edc:SFRFieldDef edc:cname="CORREN" edc:nzwidth="0x1" edc:desc="Digital Correction Logic Enable"/>
            <edc:SFRFieldDef edc:cname="RESSEL" edc:nzwidth="0x2" edc:desc="Conversion Result Resolution">
              <edc:SFRFieldSemantic edc:cname="12BIT" edc:desc="12-bit result" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16BIT" edc:desc="Accumulation or Oversampling and Decimation modes" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="10BIT" edc:desc="10-bit result" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8BIT" edc:desc="8-bit result" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WINMODE" edc:nzwidth="0x3" edc:desc="Window Monitor Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No window mode (default)" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="RESULT &gt; WINLT" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="RESULT &lt; WINUT" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="WINLT &lt; RESULT &lt; WINUT" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="MODE4" edc:desc="!(WINLT &lt; RESULT &lt; WINUT)" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="AVGCTRL" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x4200380C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SAMPLENUM" edc:nzwidth="0x4" edc:desc="Number of Samples to be Collected">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1 sample" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2 samples" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="4 samples" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 samples" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 samples" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 samples" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 samples" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 samples" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 samples" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 samples" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 samples" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADJRES" edc:nzwidth="0x3" edc:desc="Adjusting Result / Division Coefficient"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="SAMPCTRL" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:_addr="0x4200380D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SAMPLEN" edc:nzwidth="0x6" edc:desc="Sampling Time Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFCOMP" edc:nzwidth="0x1" edc:desc="Comparator Offset Compensation Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="WINLT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x4200380E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="WINLT" edc:nzwidth="0x10" edc:desc="Window Lower Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="WINUT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42003810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="WINUT" edc:nzwidth="0x10" edc:desc="Window Upper Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
